Vanrykel/Microcontrollers/LED_pong game/Psoc4_Pong.cydsn/Generated_Source/PSoC4/SPI2_SPI_UART.h
    /* Internal RX and TX buffer: for SPI or UART */
    #if (SPI2_SCB_MODE_SPI_CONST_CFG)

        /* SPI Direction */
        #define SPI2_SPI_RX_DIRECTION (1u)
        #define SPI2_SPI_TX_DIRECTION (1u)

        /* Get FIFO size */
        #define SPI2_SPI_UART_FIFO_SIZE SPI2_GET_FIFO_SIZE(SPI2_SPI_BYTE_MODE_ENABLE)

        /* SPI internal RX and TX buffers */
        #define SPI2_INTERNAL_SPI_RX_SW_BUFFER  (SPI2_SPI_RX_BUFFER_SIZE > \
                                                                SPI2_SPI_UART_FIFO_SIZE)
        #define SPI2_INTERNAL_SPI_TX_SW_BUFFER  (SPI2_SPI_TX_BUFFER_SIZE > \
                                                                SPI2_SPI_UART_FIFO_SIZE)

        /* Internal SPI RX and TX buffer */
        #define SPI2_INTERNAL_RX_SW_BUFFER  (SPI2_INTERNAL_SPI_RX_SW_BUFFER)
        #define SPI2_INTERNAL_TX_SW_BUFFER  (SPI2_INTERNAL_SPI_TX_SW_BUFFER)

        /* Internal SPI RX and TX buffer size */
        #define SPI2_INTERNAL_RX_BUFFER_SIZE    (SPI2_SPI_RX_BUFFER_SIZE + 1u)
        #define SPI2_RX_BUFFER_SIZE             (SPI2_SPI_RX_BUFFER_SIZE)
        #define SPI2_TX_BUFFER_SIZE             (SPI2_SPI_TX_BUFFER_SIZE)

        /* Get wakeup enable option */
        #define SPI2_SPI_WAKE_ENABLE_CONST  (0u != SPI2_SPI_WAKE_ENABLE)
        #define SPI2_UART_WAKE_ENABLE_CONST (0u)

    #else

        /* UART Direction */
        #define SPI2_UART_RX_DIRECTION (0u != (SPI2_UART_DIRECTION & SPI2_UART_RX))
        #define SPI2_UART_TX_DIRECTION (0u != (SPI2_UART_DIRECTION & SPI2_UART_TX))

        /* Get FIFO size */
        #define SPI2_SPI_UART_FIFO_SIZE SPI2_GET_FIFO_SIZE(SPI2_UART_BYTE_MODE_ENABLE)

        /* UART internal RX and TX buffers */
        #define SPI2_INTERNAL_UART_RX_SW_BUFFER  (SPI2_UART_RX_BUFFER_SIZE > \
                                                                SPI2_SPI_UART_FIFO_SIZE)
        #define SPI2_INTERNAL_UART_TX_SW_BUFFER  (SPI2_UART_TX_BUFFER_SIZE > \
                                                                    SPI2_SPI_UART_FIFO_SIZE)

        /* Internal UART RX and TX buffer */
        #define SPI2_INTERNAL_RX_SW_BUFFER  (SPI2_INTERNAL_UART_RX_SW_BUFFER)
        #define SPI2_INTERNAL_TX_SW_BUFFER  (SPI2_INTERNAL_UART_TX_SW_BUFFER)

        /* Internal UART RX and TX buffer size */
        #define SPI2_INTERNAL_RX_BUFFER_SIZE    (SPI2_UART_RX_BUFFER_SIZE + 1u)
        #define SPI2_RX_BUFFER_SIZE             (SPI2_UART_RX_BUFFER_SIZE)
        #define SPI2_TX_BUFFER_SIZE             (SPI2_UART_TX_BUFFER_SIZE)

        /* Get wakeup enable option */
        #define SPI2_SPI_WAKE_ENABLE_CONST  (0u)
        #define SPI2_UART_WAKE_ENABLE_CONST (0u != SPI2_UART_WAKE_ENABLE)

    #endif /* (SPI2_SCB_MODE_SPI_CONST_CFG) */

    /* Mode */
    #define SPI2_SPI_SLAVE_CONST    (SPI2_SPI_MODE == SPI2_SPI_SLAVE)
    #define SPI2_SPI_MASTER_CONST   (SPI2_SPI_MODE == SPI2_SPI_MASTER)

    /* Direction */
    #define SPI2_RX_DIRECTION ((SPI2_SCB_MODE_SPI_CONST_CFG) ? \
                                            (SPI2_SPI_RX_DIRECTION) : (SPI2_UART_RX_DIRECTION))

    #define SPI2_TX_DIRECTION ((SPI2_SCB_MODE_SPI_CONST_CFG) ? \
                                            (SPI2_SPI_TX_DIRECTION) : (SPI2_UART_TX_DIRECTION))

    /* Internal RX and TX buffer: for SPI or UART. Used in conditional compilation check */
    #define SPI2_CHECK_RX_SW_BUFFER (SPI2_INTERNAL_RX_SW_BUFFER)
    #define SPI2_CHECK_TX_SW_BUFFER (SPI2_INTERNAL_TX_SW_BUFFER)

    /* Provide global variables to support RX and TX buffers */
    #define SPI2_INTERNAL_RX_SW_BUFFER_CONST    (SPI2_INTERNAL_RX_SW_BUFFER)
    #define SPI2_INTERNAL_TX_SW_BUFFER_CONST    (SPI2_INTERNAL_TX_SW_BUFFER)

    /* Wake up enable */
    #define SPI2_CHECK_SPI_WAKE_ENABLE  (SPI2_SPI_WAKE_ENABLE_CONST)
    #define SPI2_CHECK_UART_WAKE_ENABLE (SPI2_UART_WAKE_ENABLE_CONST)

    /* UART flow control: not applicable for CY_SCBIP_V0 || CY_SCBIP_V1 */
    #define SPI2_CHECK_UART_RTS_CONTROL_FLOW    (SPI2_SCB_MODE_UART_CONST_CFG && \
                                                             SPI2_UART_RTS_ENABLE)

#endif /* End (SPI2_SCB_MODE_UNCONFIG_CONST_CFG) */


/***************************************
*       Type Definitions
***************************************/

/**
* \addtogroup group_structures
* @{
*/

/* SPI2_SPI_INIT_STRUCT */
typedef struct
{
    /** Mode of operation for SPI. The following defines are available choices:
     *  - SPI2_SPI_SLAVE
     *  - SPI2_SPI_MASTE
    */
    uint32 mode;

    /** Submode of operation for SPI. The following defines are available
     *  choices:
     *  - SPI2_SPI_MODE_MOTOROLA
     *  - SPI2_SPI_MODE_TI_COINCIDES
     *  - SPI2_SPI_MODE_TI_PRECEDES
     *  - SPI2_SPI_MODE_NATIONAL
    */
    uint32 submode;

    /** Determines the sclk relationship for Motorola submode. Ignored
     *  for other submodes. The following defines are available choices:
     *  - SPI2_SPI_SCLK_CPHA0_CPOL0
     *  - SPI2_SPI_SCLK_CPHA0_CPOL1
     *  - SPI2_SPI_SCLK_CPHA1_CPOL0
     *  - SPI2_SPI_SCLK_CPHA1_CPOL1
    */
    uint32 sclkMode;

    /** Oversampling factor for the SPI clock. Ignored for Slave mode operation.
    */
    uint32 oversample;

    /** Applies median filter on the input lines: 0 – not applied, 1 – applied.
    */
    uint32 enableMedianFilter;

    /** Applies late sampling of MISO line: 0 – not applied, 1 – applied.
     *  Ignored for slave mode.
    */
    uint32 enableLateSampling;

    /** Enables wakeup from low power mode: 0 – disable, 1 – enable.
     *  Ignored for master mode.
    */
    uint32 enableWake;

    /** Number of data bits for RX direction.
     *  Different dataBitsRx and dataBitsTx are only allowed for National
     *  submode.
    */
    uint32 rxDataBits;

    /** Number of data bits for TX direction.
     *  Different dataBitsRx and dataBitsTx are only allowed for National
     *  submode.
    */
    uint32 txDataBits;

    /** Determines the bit ordering. The following defines are available
     *  choices:
     *  - SPI2_BITS_ORDER_LSB_FIRST
     *  - SPI2_BITS_ORDER_MSB_FIRST
    */
    uint32 bitOrder;

    /** Determines whether transfers are back to back or have SS disabled
     *  between words. Ignored for slave mode. The following defines are
     *  available choices:
     *  - SPI2_SPI_TRANSFER_CONTINUOUS
     *  - SPI2_SPI_TRANSFER_SEPARATED
    */
    uint32 transferSeperation;

    /** Size of the RX buffer in bytes/words (depends on rxDataBits parameter).
     *  A value equal to the RX FIFO depth implies the usage of buffering in
     *  hardware. A value greater than the RX FIFO depth results in a software
     *  buffer.
     *  The SPI2_INTR _RX_NOT_EMPTY interrupt has to be enabled to
     *  transfer data into the software buffer.
     *  - The RX and TX FIFO depth is equal to 8 bytes/words for PSoC 4100 /
     *    PSoC 4200 devices.
     *  - The RX and TX FIFO depth is equal to 8 bytes/words or 16
     *    bytes (Byte mode is enabled) for PSoC 4100 BLE / PSoC 4200 BLE /
     *    PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *    PSoC Analog Coprocessor devices.
    */
    uint32 rxBufferSize;

    /** Buffer space provided for a RX software buffer:
     *  - A NULL pointer must be provided to use hardware buffering.
     *  - A pointer to an allocated buffer must be provided to use software
     *    buffering. The buffer size must equal (rxBufferSize + 1) in bytes if
     *    dataBitsRx is less or equal to 8, otherwise (2 * (rxBufferSize + 1))
     *    in bytes. The software RX buffer always keeps one element empty.
     *    For correct operation the allocated RX buffer has to be one element
     *    greater than maximum packet size expected to be received.
    */
    uint8* rxBuffer;

    /** Size of the TX buffer in bytes/words(depends on txDataBits parameter).
     *  A value equal to the TX FIFO depth implies the usage of buffering in
     *  hardware. A value greater than the TX FIFO depth results in a software
     *  buffer.
     *  - The RX and TX FIFO depth is equal to 8 bytes/words for PSoC 4100 /
     *    PSoC 4200 devices.
     *  - The RX and TX FIFO depth is equal to 8 bytes/words or 16
     *    bytes (Byte mode is enabled) for PSoC 4100 BLE / PSoC 4200 BLE /
     *    PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *    PSoC Analog Coprocessor devices.
    */
    uint32 txBufferSize;

    /** Buffer space provided for a TX software buffer:
     *  - A NULL pointer must be provided to use hardware buffering.
     *  - A pointer to an allocated buffer must be provided to use software
     *    buffering. The buffer size must equal txBufferSize if dataBitsTx is
     *    less or equal to 8, otherwise (2* txBufferSize).
    */
    uint8* txBuffer;

    /** Enables component interrupt: 0 – disable, 1 – enable.
     *  The interrupt has to be enabled if software buffer is used.
    */
    uint32 enableInterrupt;

    /** Mask of enabled interrupt sources for the RX direction. This mask is
     *  written regardless of the setting of the enable Interrupt field.
     *  Multiple sources are enabled by providing a value that is the OR of
     *  all of the following sources to enable:
     *  - SPI2_INTR_RX_FIFO_LEVEL
     *  - SPI2_INTR_RX_NOT_EMPTY
     *  - SPI2_INTR_RX_FULL
     *  - SPI2_INTR_RX_OVERFLOW
     *  - SPI2_INTR_RX_UNDERFLOW
     *  - SPI2_INTR_SLAVE_SPI_BUS_ERROR
    */
    uint32 rxInterruptMask;

    /** FIFO level for an RX FIFO level interrupt. This value is written
     *  regardless of whether the RX FIFO level interrupt source is enabled.
    */
    uint32 rxTriggerLevel;

