Vanrykel/Microcontrollers/LED_pong game/Psoc4_Pong.cydsn/Generated_Source/PSoC4/SPI2_SPI_UART.h
        void SPI2_UartPutString(const char8 string[]);
        void SPI2_UartPutCRLF(uint32 txDataByte);
        void SPI2_UartSendBreakBlocking(uint32 breakWidth);

        #if !(SPI2_CY_SCBIP_V0 || SPI2_CY_SCBIP_V1)
            /* UART APIs for Flow Control */
            void SPI2_UartEnableCts(void);
            void SPI2_UartDisableCts(void);
            void SPI2_UartSetCtsPolarity(uint32 polarity);
        #endif /* !(SPI2_CY_SCBIP_V0 || SPI2_CY_SCBIP_V1) */
    #endif /* (SPI2_UART_TX_DIRECTION) */
#endif /* (SPI2_SCB_MODE_UART_INC) */
/** @} uart */

/**
* \addtogroup group_spi_uart
* @{
*/
#if(SPI2_RX_DIRECTION)
    uint32 SPI2_SpiUartReadRxData(void);
    uint32 SPI2_SpiUartGetRxBufferSize(void);
    void   SPI2_SpiUartClearRxBuffer(void);
#endif /* (SPI2_RX_DIRECTION) */

/* Common APIs TX direction */
#if(SPI2_TX_DIRECTION)
    void   SPI2_SpiUartWriteTxData(uint32 txData);
    void   SPI2_SpiUartPutArray(const uint8 wrBuf[], uint32 count);
    uint32 SPI2_SpiUartGetTxBufferSize(void);
    void   SPI2_SpiUartClearTxBuffer(void);
#endif /* (SPI2_TX_DIRECTION) */
/** @} spi_uart */

CY_ISR_PROTO(SPI2_SPI_UART_ISR);

#if(SPI2_UART_RX_WAKEUP_IRQ)
    CY_ISR_PROTO(SPI2_UART_WAKEUP_ISR);
#endif /* (SPI2_UART_RX_WAKEUP_IRQ) */


/***************************************
*     Buffer Access Macro Definitions
***************************************/

#if(SPI2_SCB_MODE_UNCONFIG_CONST_CFG)
    /* RX direction */
    void   SPI2_PutWordInRxBuffer  (uint32 idx, uint32 rxDataByte);
    uint32 SPI2_GetWordFromRxBuffer(uint32 idx);

    /* TX direction */
    void   SPI2_PutWordInTxBuffer  (uint32 idx, uint32 txDataByte);
    uint32 SPI2_GetWordFromTxBuffer(uint32 idx);

#else
    /* RX direction */
    #if(SPI2_INTERNAL_RX_SW_BUFFER_CONST)
        #define SPI2_PutWordInRxBuffer(idx, rxDataByte) \
                do{                                                 \
                    SPI2_rxBufferInternal[(idx)] = ((uint8) (rxDataByte)); \
                }while(0)

        #define SPI2_GetWordFromRxBuffer(idx) SPI2_rxBufferInternal[(idx)]

    #endif /* (SPI2_INTERNAL_RX_SW_BUFFER_CONST) */

    /* TX direction */
    #if(SPI2_INTERNAL_TX_SW_BUFFER_CONST)
        #define SPI2_PutWordInTxBuffer(idx, txDataByte) \
                    do{                                             \
                        SPI2_txBufferInternal[(idx)] = ((uint8) (txDataByte)); \
                    }while(0)

        #define SPI2_GetWordFromTxBuffer(idx) SPI2_txBufferInternal[(idx)]

    #endif /* (SPI2_INTERNAL_TX_SW_BUFFER_CONST) */

#endif /* (SPI2_TX_SW_BUFFER_ENABLE) */


/***************************************
*         SPI API Constants
***************************************/

/* SPI sub mode enum */
#define SPI2_SPI_MODE_MOTOROLA      (0x00u)
#define SPI2_SPI_MODE_TI_COINCIDES  (0x01u)
#define SPI2_SPI_MODE_TI_PRECEDES   (0x11u)
#define SPI2_SPI_MODE_NATIONAL      (0x02u)
#define SPI2_SPI_MODE_MASK          (0x03u)
#define SPI2_SPI_MODE_TI_PRECEDES_MASK  (0x10u)
#define SPI2_SPI_MODE_NS_MICROWIRE  (SPI2_SPI_MODE_NATIONAL)

/* SPI phase and polarity mode enum */
#define SPI2_SPI_SCLK_CPHA0_CPOL0   (0x00u)
#define SPI2_SPI_SCLK_CPHA0_CPOL1   (0x02u)
#define SPI2_SPI_SCLK_CPHA1_CPOL0   (0x01u)
#define SPI2_SPI_SCLK_CPHA1_CPOL1   (0x03u)

/* SPI bits order enum */
#define SPI2_BITS_ORDER_LSB_FIRST   (0u)
#define SPI2_BITS_ORDER_MSB_FIRST   (1u)

/* SPI transfer separation enum */
#define SPI2_SPI_TRANSFER_SEPARATED     (0u)
#define SPI2_SPI_TRANSFER_CONTINUOUS    (1u)

/* SPI slave select constants */
#define SPI2_SPI_SLAVE_SELECT0    (SPI2_SCB__SS0_POSISTION)
#define SPI2_SPI_SLAVE_SELECT1    (SPI2_SCB__SS1_POSISTION)
#define SPI2_SPI_SLAVE_SELECT2    (SPI2_SCB__SS2_POSISTION)
#define SPI2_SPI_SLAVE_SELECT3    (SPI2_SCB__SS3_POSISTION)

/* SPI slave select polarity settings */
#define SPI2_SPI_SS_ACTIVE_LOW  (0u)
#define SPI2_SPI_SS_ACTIVE_HIGH (1u)

#define SPI2_INTR_SPIM_TX_RESTORE   (SPI2_INTR_TX_OVERFLOW)

#define SPI2_INTR_SPIS_TX_RESTORE     (SPI2_INTR_TX_OVERFLOW | \
                                                 SPI2_INTR_TX_UNDERFLOW)

/***************************************
*         UART API Constants
***************************************/

/* UART sub-modes enum */
#define SPI2_UART_MODE_STD          (0u)
#define SPI2_UART_MODE_SMARTCARD    (1u)
#define SPI2_UART_MODE_IRDA         (2u)

/* UART direction enum */
#define SPI2_UART_RX    (1u)
#define SPI2_UART_TX    (2u)
#define SPI2_UART_TX_RX (3u)

/* UART parity enum */
#define SPI2_UART_PARITY_EVEN   (0u)
#define SPI2_UART_PARITY_ODD    (1u)
#define SPI2_UART_PARITY_NONE   (2u)

/* UART stop bits enum */
#define SPI2_UART_STOP_BITS_1   (2u)
#define SPI2_UART_STOP_BITS_1_5 (3u)
#define SPI2_UART_STOP_BITS_2   (4u)

/* UART IrDA low power OVS enum */
#define SPI2_UART_IRDA_LP_OVS16     (16u)
#define SPI2_UART_IRDA_LP_OVS32     (32u)
#define SPI2_UART_IRDA_LP_OVS48     (48u)
#define SPI2_UART_IRDA_LP_OVS96     (96u)
#define SPI2_UART_IRDA_LP_OVS192    (192u)
#define SPI2_UART_IRDA_LP_OVS768    (768u)
#define SPI2_UART_IRDA_LP_OVS1536   (1536u)

/* Uart MP: mark (address) and space (data) bit definitions */
#define SPI2_UART_MP_MARK       (0x100u)
#define SPI2_UART_MP_SPACE      (0x000u)

/* UART CTS/RTS polarity settings */
#define SPI2_UART_CTS_ACTIVE_LOW    (0u)
#define SPI2_UART_CTS_ACTIVE_HIGH   (1u)
#define SPI2_UART_RTS_ACTIVE_LOW    (0u)
#define SPI2_UART_RTS_ACTIVE_HIGH   (1u)

/* Sources of RX errors */
#define SPI2_INTR_RX_ERR        (SPI2_INTR_RX_OVERFLOW    | \
                                             SPI2_INTR_RX_UNDERFLOW   | \
                                             SPI2_INTR_RX_FRAME_ERROR | \
                                             SPI2_INTR_RX_PARITY_ERROR)

/* Shifted INTR_RX_ERR defines ONLY for SPI2_UartGetByte() */
#define SPI2_UART_RX_OVERFLOW       (SPI2_INTR_RX_OVERFLOW << 8u)
#define SPI2_UART_RX_UNDERFLOW      (SPI2_INTR_RX_UNDERFLOW << 8u)
#define SPI2_UART_RX_FRAME_ERROR    (SPI2_INTR_RX_FRAME_ERROR << 8u)
#define SPI2_UART_RX_PARITY_ERROR   (SPI2_INTR_RX_PARITY_ERROR << 8u)
#define SPI2_UART_RX_ERROR_MASK     (SPI2_UART_RX_OVERFLOW    | \
                                                 SPI2_UART_RX_UNDERFLOW   | \
                                                 SPI2_UART_RX_FRAME_ERROR | \
                                                 SPI2_UART_RX_PARITY_ERROR)

#define SPI2_INTR_UART_TX_RESTORE   (SPI2_INTR_TX_OVERFLOW  | \
                                                 SPI2_INTR_TX_UART_NACK | \
                                                 SPI2_INTR_TX_UART_DONE | \
                                                 SPI2_INTR_TX_UART_ARB_LOST)


