Vanrykel/Microcontrollers/LED_pong game/Psoc4_Pong.cydsn/Generated_Source/PSoC4/SPI2_SPI_UART.h
/***************************************
*     Vars with External Linkage
***************************************/

#if(SPI2_SCB_MODE_UNCONFIG_CONST_CFG)
    extern const SPI2_SPI_INIT_STRUCT  SPI2_configSpi;
    extern const SPI2_UART_INIT_STRUCT SPI2_configUart;
#endif /* (SPI2_SCB_MODE_UNCONFIG_CONST_CFG) */

#if (SPI2_UART_WAKE_ENABLE_CONST && SPI2_UART_RX_WAKEUP_IRQ)
    extern uint8 SPI2_skipStart;
#endif /* (SPI2_UART_WAKE_ENABLE_CONST && SPI2_UART_RX_WAKEUP_IRQ) */


/***************************************
*    Specific SPI Macro Definitions
***************************************/

#define SPI2_GET_SPI_INTR_SLAVE_MASK(sourceMask)  ((sourceMask) & SPI2_INTR_SLAVE_SPI_BUS_ERROR)
#define SPI2_GET_SPI_INTR_MASTER_MASK(sourceMask) ((sourceMask) & SPI2_INTR_MASTER_SPI_DONE)
#define SPI2_GET_SPI_INTR_RX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~SPI2_INTR_SLAVE_SPI_BUS_ERROR)

#define SPI2_GET_SPI_INTR_TX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~SPI2_INTR_MASTER_SPI_DONE)


/***************************************
*    Specific UART Macro Definitions
***************************************/

#define SPI2_UART_GET_CTRL_OVS_IRDA_LP(oversample) \
        ((SPI2_UART_IRDA_LP_OVS16   == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS16 : \
         ((SPI2_UART_IRDA_LP_OVS32   == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS32 : \
          ((SPI2_UART_IRDA_LP_OVS48   == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS48 : \
           ((SPI2_UART_IRDA_LP_OVS96   == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS96 : \
            ((SPI2_UART_IRDA_LP_OVS192  == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS192 : \
             ((SPI2_UART_IRDA_LP_OVS768  == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS768 : \
              ((SPI2_UART_IRDA_LP_OVS1536 == (oversample)) ? SPI2_CTRL_OVS_IRDA_LP_OVS1536 : \
                                                                          SPI2_CTRL_OVS_IRDA_LP_OVS16)))))))

#define SPI2_GET_UART_RX_CTRL_ENABLED(direction) ((0u != (SPI2_UART_RX & (direction))) ? \
                                                                     (SPI2_RX_CTRL_ENABLED) : (0u))

#define SPI2_GET_UART_TX_CTRL_ENABLED(direction) ((0u != (SPI2_UART_TX & (direction))) ? \
                                                                     (SPI2_TX_CTRL_ENABLED) : (0u))


/***************************************
*        SPI Register Settings
***************************************/

#define SPI2_CTRL_SPI      (SPI2_CTRL_MODE_SPI)
#define SPI2_SPI_RX_CTRL   (SPI2_RX_CTRL_ENABLED)
#define SPI2_SPI_TX_CTRL   (SPI2_TX_CTRL_ENABLED)


/***************************************
*       SPI Init Register Settings
***************************************/

#define SPI2_SPI_SS_POLARITY \
             (((uint32) SPI2_SPI_SS0_POLARITY << SPI2_SPI_SLAVE_SELECT0) | \
              ((uint32) SPI2_SPI_SS1_POLARITY << SPI2_SPI_SLAVE_SELECT1) | \
              ((uint32) SPI2_SPI_SS2_POLARITY << SPI2_SPI_SLAVE_SELECT2) | \
              ((uint32) SPI2_SPI_SS3_POLARITY << SPI2_SPI_SLAVE_SELECT3))

#if(SPI2_SCB_MODE_SPI_CONST_CFG)

    /* SPI Configuration */
    #define SPI2_SPI_DEFAULT_CTRL \
                    (SPI2_GET_CTRL_OVS(SPI2_SPI_OVS_FACTOR) | \
                     SPI2_GET_CTRL_BYTE_MODE (SPI2_SPI_BYTE_MODE_ENABLE) | \
                     SPI2_GET_CTRL_EC_AM_MODE(SPI2_SPI_WAKE_ENABLE)      | \
                     SPI2_CTRL_SPI)

    #define SPI2_SPI_DEFAULT_SPI_CTRL \
                    (SPI2_GET_SPI_CTRL_CONTINUOUS    (SPI2_SPI_TRANSFER_SEPARATION)       | \
                     SPI2_GET_SPI_CTRL_SELECT_PRECEDE(SPI2_SPI_SUB_MODE &                   \
                                                                  SPI2_SPI_MODE_TI_PRECEDES_MASK)     | \
                     SPI2_GET_SPI_CTRL_SCLK_MODE     (SPI2_SPI_CLOCK_MODE)                | \
                     SPI2_GET_SPI_CTRL_LATE_MISO_SAMPLE(SPI2_SPI_LATE_MISO_SAMPLE_ENABLE) | \
                     SPI2_GET_SPI_CTRL_SCLK_CONTINUOUS(SPI2_SPI_FREE_RUN_SCLK_ENABLE)     | \
                     SPI2_GET_SPI_CTRL_SSEL_POLARITY (SPI2_SPI_SS_POLARITY)               | \
                     SPI2_GET_SPI_CTRL_SUB_MODE      (SPI2_SPI_SUB_MODE)                  | \
                     SPI2_GET_SPI_CTRL_MASTER_MODE   (SPI2_SPI_MODE))

    /* RX direction */
    #define SPI2_SPI_DEFAULT_RX_CTRL \
                    (SPI2_GET_RX_CTRL_DATA_WIDTH(SPI2_SPI_RX_DATA_BITS_NUM)     | \
                     SPI2_GET_RX_CTRL_BIT_ORDER (SPI2_SPI_BITS_ORDER)           | \
                     SPI2_GET_RX_CTRL_MEDIAN    (SPI2_SPI_MEDIAN_FILTER_ENABLE) | \
                     SPI2_SPI_RX_CTRL)

    #define SPI2_SPI_DEFAULT_RX_FIFO_CTRL \
                    SPI2_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(SPI2_SPI_RX_TRIGGER_LEVEL)

    /* TX direction */
    #define SPI2_SPI_DEFAULT_TX_CTRL \
                    (SPI2_GET_TX_CTRL_DATA_WIDTH(SPI2_SPI_TX_DATA_BITS_NUM) | \
                     SPI2_GET_TX_CTRL_BIT_ORDER (SPI2_SPI_BITS_ORDER)       | \
                     SPI2_SPI_TX_CTRL)

    #define SPI2_SPI_DEFAULT_TX_FIFO_CTRL \
                    SPI2_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(SPI2_SPI_TX_TRIGGER_LEVEL)

    /* Interrupt sources */
    #define SPI2_SPI_DEFAULT_INTR_SPI_EC_MASK   (SPI2_NO_INTR_SOURCES)

    #define SPI2_SPI_DEFAULT_INTR_I2C_EC_MASK   (SPI2_NO_INTR_SOURCES)
    #define SPI2_SPI_DEFAULT_INTR_SLAVE_MASK \
                    (SPI2_SPI_INTR_RX_MASK & SPI2_INTR_SLAVE_SPI_BUS_ERROR)

    #define SPI2_SPI_DEFAULT_INTR_MASTER_MASK \
                    (SPI2_SPI_INTR_TX_MASK & SPI2_INTR_MASTER_SPI_DONE)

    #define SPI2_SPI_DEFAULT_INTR_RX_MASK \
                    (SPI2_SPI_INTR_RX_MASK & (uint32) ~SPI2_INTR_SLAVE_SPI_BUS_ERROR)

    #define SPI2_SPI_DEFAULT_INTR_TX_MASK \
                    (SPI2_SPI_INTR_TX_MASK & (uint32) ~SPI2_INTR_MASTER_SPI_DONE)

#endif /* (SPI2_SCB_MODE_SPI_CONST_CFG) */


