Vanrykel/Microcontrollers/LED_pong game/Psoc4_Pong.cydsn/Generated_Source/PSoC4/SPI2_SPI_UART.h
/***************************************
*        UART Register Settings
***************************************/

#define SPI2_CTRL_UART      (SPI2_CTRL_MODE_UART)
#define SPI2_UART_RX_CTRL   (SPI2_RX_CTRL_LSB_FIRST) /* LSB for UART goes first */
#define SPI2_UART_TX_CTRL   (SPI2_TX_CTRL_LSB_FIRST) /* LSB for UART goes first */


/***************************************
*      UART Init Register Settings
***************************************/

#if(SPI2_SCB_MODE_UART_CONST_CFG)

    /* UART configuration */
    #if(SPI2_UART_MODE_IRDA == SPI2_UART_SUB_MODE)

        #define SPI2_DEFAULT_CTRL_OVS   ((0u != SPI2_UART_IRDA_LOW_POWER) ?              \
                                (SPI2_UART_GET_CTRL_OVS_IRDA_LP(SPI2_UART_OVS_FACTOR)) : \
                                (SPI2_CTRL_OVS_IRDA_OVS16))

    #else

        #define SPI2_DEFAULT_CTRL_OVS   SPI2_GET_CTRL_OVS(SPI2_UART_OVS_FACTOR)

    #endif /* (SPI2_UART_MODE_IRDA == SPI2_UART_SUB_MODE) */

    #define SPI2_UART_DEFAULT_CTRL \
                                (SPI2_GET_CTRL_BYTE_MODE  (SPI2_UART_BYTE_MODE_ENABLE)  | \
                                 SPI2_GET_CTRL_ADDR_ACCEPT(SPI2_UART_MP_ACCEPT_ADDRESS) | \
                                 SPI2_DEFAULT_CTRL_OVS                                              | \
                                 SPI2_CTRL_UART)

    #define SPI2_UART_DEFAULT_UART_CTRL \
                                    (SPI2_GET_UART_CTRL_MODE(SPI2_UART_SUB_MODE))

    /* RX direction */
    #define SPI2_UART_DEFAULT_RX_CTRL_PARITY \
                                ((SPI2_UART_PARITY_NONE != SPI2_UART_PARITY_TYPE) ?      \
                                  (SPI2_GET_UART_RX_CTRL_PARITY(SPI2_UART_PARITY_TYPE) | \
                                   SPI2_UART_RX_CTRL_PARITY_ENABLED) : (0u))

    #define SPI2_UART_DEFAULT_UART_RX_CTRL \
                    (SPI2_GET_UART_RX_CTRL_MODE(SPI2_UART_STOP_BITS_NUM)                    | \
                     SPI2_GET_UART_RX_CTRL_POLARITY(SPI2_UART_IRDA_POLARITY)                | \
                     SPI2_GET_UART_RX_CTRL_MP_MODE(SPI2_UART_MP_MODE_ENABLE)                | \
                     SPI2_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(SPI2_UART_DROP_ON_PARITY_ERR) | \
                     SPI2_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(SPI2_UART_DROP_ON_FRAME_ERR)   | \
                     SPI2_GET_UART_RX_CTRL_BREAK_WIDTH(SPI2_UART_RX_BREAK_WIDTH)            | \
                     SPI2_UART_DEFAULT_RX_CTRL_PARITY)


    #define SPI2_UART_DEFAULT_RX_CTRL \
                                (SPI2_GET_RX_CTRL_DATA_WIDTH(SPI2_UART_DATA_BITS_NUM)        | \
                                 SPI2_GET_RX_CTRL_MEDIAN    (SPI2_UART_MEDIAN_FILTER_ENABLE) | \
                                 SPI2_GET_UART_RX_CTRL_ENABLED(SPI2_UART_DIRECTION))

    #define SPI2_UART_DEFAULT_RX_FIFO_CTRL \
                                SPI2_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(SPI2_UART_RX_TRIGGER_LEVEL)

    #define SPI2_UART_DEFAULT_RX_MATCH_REG  ((0u != SPI2_UART_MP_MODE_ENABLE) ?          \
                                (SPI2_GET_RX_MATCH_ADDR(SPI2_UART_MP_RX_ADDRESS) | \
                                 SPI2_GET_RX_MATCH_MASK(SPI2_UART_MP_RX_ADDRESS_MASK)) : (0u))

    /* TX direction */
    #define SPI2_UART_DEFAULT_TX_CTRL_PARITY (SPI2_UART_DEFAULT_RX_CTRL_PARITY)

    #define SPI2_UART_DEFAULT_UART_TX_CTRL \
                                (SPI2_GET_UART_TX_CTRL_MODE(SPI2_UART_STOP_BITS_NUM)       | \
                                 SPI2_GET_UART_TX_CTRL_RETRY_NACK(SPI2_UART_RETRY_ON_NACK) | \
                                 SPI2_UART_DEFAULT_TX_CTRL_PARITY)

    #define SPI2_UART_DEFAULT_TX_CTRL \
                                (SPI2_GET_TX_CTRL_DATA_WIDTH(SPI2_UART_DATA_BITS_NUM) | \
                                 SPI2_GET_UART_TX_CTRL_ENABLED(SPI2_UART_DIRECTION))

    #define SPI2_UART_DEFAULT_TX_FIFO_CTRL \
                                SPI2_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(SPI2_UART_TX_TRIGGER_LEVEL)

    #define SPI2_UART_DEFAULT_FLOW_CTRL \
                        (SPI2_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(SPI2_UART_RTS_FIFO_LEVEL) | \
                         SPI2_GET_UART_FLOW_CTRL_RTS_POLARITY (SPI2_UART_RTS_POLARITY)   | \
                         SPI2_GET_UART_FLOW_CTRL_CTS_POLARITY (SPI2_UART_CTS_POLARITY)   | \
                         SPI2_GET_UART_FLOW_CTRL_CTS_ENABLE   (SPI2_UART_CTS_ENABLE))

    /* Interrupt sources */
    #define SPI2_UART_DEFAULT_INTR_I2C_EC_MASK  (SPI2_NO_INTR_SOURCES)
    #define SPI2_UART_DEFAULT_INTR_SPI_EC_MASK  (SPI2_NO_INTR_SOURCES)
    #define SPI2_UART_DEFAULT_INTR_SLAVE_MASK   (SPI2_NO_INTR_SOURCES)
    #define SPI2_UART_DEFAULT_INTR_MASTER_MASK  (SPI2_NO_INTR_SOURCES)
    #define SPI2_UART_DEFAULT_INTR_RX_MASK      (SPI2_UART_INTR_RX_MASK)
    #define SPI2_UART_DEFAULT_INTR_TX_MASK      (SPI2_UART_INTR_TX_MASK)

#endif /* (SPI2_SCB_MODE_UART_CONST_CFG) */


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

#define SPI2_SPIM_ACTIVE_SS0    (SPI2_SPI_SLAVE_SELECT0)
#define SPI2_SPIM_ACTIVE_SS1    (SPI2_SPI_SLAVE_SELECT1)
#define SPI2_SPIM_ACTIVE_SS2    (SPI2_SPI_SLAVE_SELECT2)
#define SPI2_SPIM_ACTIVE_SS3    (SPI2_SPI_SLAVE_SELECT3)

#endif /* CY_SCB_SPI_UART_SPI2_H */


/* [] END OF FILE */
